Aula10/app/Controllers/EstoqueController.php

SELECT *
FROM `produtos`
---
    public function listarPublico()
    {
        $produtos = $this->produtoModel->findAll();