Aula10/app/Controllers/PainelController.php

        $produtos = $queryConsumo->get()->getResultArray();

        // Categorias para o filtro
        $categorias = $db->table('produtos')
            ->select('categoria')
            ->where('categoria IS NOT NULL')
            ->groupBy('categoria')
            ->get()->getResultArray();
---
SELECT `categoria`
FROM `produtos`
WHERE `categoria` IS NOT NULL
GROUP BY `categoria`