Aula10/app/Controllers/UsuarioController.php

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '10'
---
    public function perfil()
    {
        $model = new UsuarioModel();
        $usuario = $model->find(session()->get('usuario_id'));