Aula10/app/Controllers/Api/ApiController.php

SELECT *
FROM `produtos`
---
    public function get_produtos()
    {
        $produtoModel = new ProdutoModel();
        $produtos = $produtoModel->findAll();

SELECT *
FROM `pedidos`
WHERE `pedidos`.`deleted_at` IS NULL
SELECT *
FROM `pedido_produtos`
WHERE `id_pedido` = '1'
AND `pedido_produtos`.`deleted_at` IS NULL
SELECT *
FROM `produtos`
WHERE `produtos`.`id` = '2'
---
    public function get_pedidos()
    {
        $pedidoModel = new PedidoModel();
        $pedidoProdutoModel = new PedidoProdutoModel();
        $produtoModel = new ProdutoModel();

        $pedidos = $pedidoModel->findAll();

        foreach ($pedidos as &$pedido) {
            $itens = $pedidoProdutoModel->where('id_pedido', $pedido['id'])->findAll();

            foreach ($itens as &$item) {
                $item['produto'] = $produtoModel->find($item['id_produto']);

SELECT *
FROM `pedidos`
WHERE `pedidos`.`deleted_at` IS NULL
AND `pedidos`.`id` = '14'
SELECT *
FROM `pedido_produtos`
WHERE `id_pedido` = '14'
AND `pedido_produtos`.`deleted_at` IS NULL
SELECT *
FROM `produtos`
WHERE `produtos`.`id` = '4'
---
    public function get_pedido($id)
    {
        $pedidoModel = new PedidoModel();
        $pedidoProdutoModel = new PedidoProdutoModel();
        $produtoModel = new ProdutoModel();

        $pedido = $pedidoModel->find($id);

        if (!$pedido) {
            return $this->failNotFound('Pedido não encontrado.');
        }

        $itens = $pedidoProdutoModel->where('id_pedido', $id)->findAll();

        foreach ($itens as &$item) {
            $item['produto'] = $produtoModel->find($item['id_produto']);

SELECT *
FROM `produtos`
WHERE `produtos`.`id` = '4'
---
    public function checkout()
{
    $apiKey = $this->request->getHeaderLine('apiKey');

    if (!$apiKey) {
        return $this->failUnauthorized('API Key não informada.');
    }

    if ($apiKey != env('API_KEY')) {
        return $this->failUnauthorized('API Key inválida.');
    }

    $dados = $this->request->getJSON(true);

    if (!$dados) {
        return $this->failValidationErrors('JSON inválido.');
    }

    if (!isset($dados['produtos']) || empty($dados['produtos'])) {
        return $this->failValidationErrors('O pedido precisa ter pelo menos um produto.');
    }

    $pedidoModel        = new PedidoModel();
    $pedidoProdutoModel = new PedidoProdutoModel();
    $produtoModel       = new ProdutoModel();

    // Verifica estoque antes de qualquer coisa
    foreach ($dados['produtos'] as $produto) {
        $produtoAtual = $produtoModel->find($produto['id_produto']);

INSERT INTO `pedidos` (`status`, `totem_id`, `totem_name`, `totem_ip`, `created_at`, `updated_at`) VALUES ('novo', 'totem 01', 'totem 01', 'local', '2026-07-01 00:57:12', '2026-07-01 00:57:12')
INSERT INTO `pedido_produtos` (`id_pedido`, `id_produto`, `quantidade`, `preco_unitario`, `created_at`, `updated_at`) VALUES (14, '4', 1, '8.00', '2026-07-01 00:43:23', '2026-07-01 00:43:23')
SELECT *
FROM `produtos`
WHERE `produtos`.`id` = '4'
UPDATE `produtos` SET `estoque` = 18, `updated_at` = '2026-07-01 00:43:23'
WHERE `produtos`.`id` IN ('4')
---
    $db = \Config\Database::connect();
    $db->transStart();

    $idPedido = $pedidoModel->insert([
        'status' => $dados['status'] ?? 'novo'
    ]);

    foreach ($dados['produtos'] as $produto) {
        $pedidoProdutoModel->insert([
            'id_pedido'      => $idPedido,
            'id_produto'     => $produto['id_produto'],
            'quantidade'     => $produto['quantidade'],
            'preco_unitario' => $produto['preco_unitario']
        ]);

        $produtoAtual = $produtoModel->find($produto['id_produto']);
        $produtoModel->update($produto['id_produto'], [
            'estoque' => $produtoAtual['estoque'] - (int) $produto['quantidade']
        ]);